---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.AssetPropertyType.Boolean
enum: Autodesk.Revit.DB.Visual.AssetPropertyType
source: html/3463b8a3-5c87-63c0-03d1-a20e442f6f28.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyType.Boolean

Represents property Boolean. The corresponding AssetProperty sub class is AssetPropertyBoolean.